{
    "title": "Условия использования",
    "lastUpdated": "Дата последнего обновления: {{date}}",
    "sections": {
      "general": {
        "title": "1. Общие положения",
        "content": "Настоящие Условия использования регулируют использование услуг {{salonName}}. Используя наши услуги, вы соглашаетесь с данными условиями."
      },
      "booking": {
        "title": "2. Бронирование и отмена",
        "paragraph1": "Для записи на процедуры необходимо предоставить корректную контактную информацию. Мы оставляем за собой право подтвердить или отклонить бронирование.",
        "cancellationTitle": "Отмена записи:",
        "cancellationText": "Клиент может отменить запись не позднее чем за 24 часа до назначенного времени. При отмене менее чем за 24 часа может взиматься штраф в размере 50% от стоимости услуги."
      },
      "payment": {
        "title": "3. Оплата услуг",
        "paragraph1": "Оплата производится наличными или картой после оказания услуги. Цены на услуги указаны в прайс-листе и могут быть изменены без предварительного уведомления.",
        "paragraph2": "В случае опоздания клиента более чем на 15 минут, салон оставляет за собой право отменить запись или сократить время процедуры."
      },
      "medical": {
        "title": "4. Медицинские противопоказания",
        "paragraph1": "Клиент обязан сообщить мастеру о наличии любых медицинских противопоказаний, аллергий или особенностей здоровья перед проведением процедуры.",
        "paragraph2": "Салон не несет ответственности за последствия процедур, если клиент скрыл информацию о медицинских противопоказаниях."
      },
      "warranty": {
        "title": "5. Гарантии и ответственность",
        "paragraph1": "Мы гарантируем качество используемых материалов и профессионализм наших мастеров. Результат процедур может варьироваться в зависимости от индивидуальных особенностей клиента.",
        "paragraph2": "В случае неудовлетворенности результатом, клиент должен обратиться в салон в течение 7 дней для обсуждения возможных вариантов решения."
      },
      "privacy": {
        "title": "6. Конфиденциальность",
        "content": "Мы уважаем вашу конфиденциальность и обязуемся защищать ваши персональные данные в соответствии с нашей <link>Политикой конфиденциальности</link>."
      },
      "changes": {
        "title": "7. Изменения условий",
        "content": "Мы оставляем за собой право изменять данные Условия использования в любое время. Изменения вступают в силу с момента публикации на сайте."
      },
      "contact": {
        "title": "8. Контакты",
        "description": "По всем вопросам, связанным с данными Условиями, вы можете связаться с нами:",
        "phone": "Телефон",
        "email": "Email",
        "address": "Адрес"
      }
    }
  }