{
  "items": [
    {
      "id": 1,
      "name": "Kasymova Gulchekhre",
      "position": "Maître des ongles et de l'épilation",
      "bio": "Gulya est une experte reconnue dans le domaine de la manucure, de l'épilation et des soins professionnels du visage avec 8 ans d'expérience. Grâce à sa maîtrise des techniques de transformation esthétique et à son souci du détail, elle crée des images impeccables, offrant à chaque client le plus haut niveau de soin et d’approche professionnelle.",
      "photo": ""
    },
    {
      "id": 2,
      "name": "Peradilla Jennifer",
      "position": "Universal Beauty Master",
      "bio": "Jennifer incarne le talent d'une professionnelle multidisciplinaire. Elle exécute magistralement des procédures de beauté de base et complexes, offrant une approche globale et harmonieuse de votre transformation.",
      "photo": ""
    },
    {
      "id": 3,
      "name": "Amandurdyyeva Mestan",
      "position": "Coiffeur et maquilleur permanent",
      "bio": "Mestan est un maître unique qui allie le talent d'un styliste de haut niveau et d'un expert en maquillage permanent. Ses connaissances approfondies vous permettent de créer des images complètes et impeccables qui mettent en valeur votre individualité.",
      "photo": ""
    },
    {
      "id": 4,
      "name": "Mokhammed Sabri",
      "position": "Coiffeur",
      "bio": "Simo est le principal expert de notre salon dans le domaine des soins haut de gamme et des colorations complexes. Ses nombreuses années d’expérience internationale et ses techniques exclusives garantissent des résultats de la plus haute classe.",
      "photo": ""
    },
    {
      "id": 5,
      "name": "Kozhabay Lyazat",
      "position": "Nail Master",
      "bio": "Lyazat est un véritable perfectionniste dans le secteur des services d'ongles. Avec un goût impeccable et une attention aux détails, elle crée la manucure et la pédicure parfaites, en prenant soin de l'esthétique et de la santé de vos mains.",
      "photo": ""
    },
    {
      "id": 6,
      "name": "Tursunaï",
      "position": "Propriétaire/Directeur",
      "bio": "",
      "photo": ""
    },
    {
      "id": 7,
      "name": "Administrateur",
      "position": "Administrateur système",
      "bio": "",
      "photo": ""
    }
  ]
}