{
  "items": [
    {
      "id": 1,
      "name": "Касымова Гульчехре",
      "position": "Мастер маникюра и депиляции",
      "bio": "Гуля — признанный эксперт в области маникюра, депиляции и профессионального ухода за лицом с 8-летним опытом. Благодаря совершенному владению техниками эстетического преображения и вниманию к деталям, она создает безупречные образы, обеспечивая каждому клиенту высочайший уровень заботы и профессиональный подход.",
      "photo": ""
    },
    {
      "id": 2,
      "name": "Перадилья Дженнифер",
      "position": "Мастер универсальной красоты",
      "bio": "Дженнифер воплощает в себе талант многопрофильного специалиста. Она виртуозно выполняет как базовые, так и сложные бьюти-процедуры, обеспечивая комплексный и гармоничный подход к вашему преображению.",
      "photo": ""
    },
    {
      "id": 3,
      "name": "Amandurdyyeva Mestan",
      "position": "стилист по волосам и Мастер перманентного макияжа",
      "bio": "Местан — уникальный мастер, сочетающий в себе талант топ-стилиста и эксперта по перманентному макияжу. Ее глубокие знания позволяют создавать законченные и безупречные образы, подчеркивающие вашу индивидуальность.",
      "photo": ""
    },
    {
      "id": 4,
      "name": "Мохаммед Сабри",
      "position": "стилист по волосам",
      "bio": "Симо является ведущим экспертом нашего салона в области премиального ухода и сложного колорирования. Его многолетний международный опыт и авторские методики гарантируют результат высочайшего класса.",
      "photo": ""
    },
    {
      "id": 5,
      "name": "Kozhabay Lyazat",
      "position": "Мастер маникюра",
      "bio": "Лязат — истинный перфекционист в индустрии ногтевого сервиса. Обладая безупречным вкусом и вниманием к деталям, она создает идеальный маникюр и педикюр, заботясь об эстетике и здоровье ваших рук.",
      "photo": ""
    },
    {
      "id": 6,
      "name": "Турсунай",
      "position": "Владелец/Директор",
      "bio": "",
      "photo": ""
    },
    {
      "id": 7,
      "name": "Админ",
      "position": "Системный администратор",
      "bio": "",
      "photo": ""
    }
  ]
}