{
  "booking_and_cancellation": "Reservas y cancelaciones",
  "booking_requirements": "Para registrarse en Tratamientos, debe proporcionar un contacto válido información. Nos reservamos el derecho de confirmar o rechazar su reserva.",
  "cancellation_policy": "Política de cancelación",
  "cancellation_policy_text": "El cliente podrá cancelar la cita hasta 24 horas antes de la hora prevista. Si cancela con menos de 24 horas de anticipación, se podrá cobrar una penalidad del 50% del costo del servicio.",
  "client_obligations": "Antes del procedimiento, el cliente deberá informar al especialista sobre contraindicaciones médicas, alergias o condiciones de salud.",
  "confidentiality": "Confidencialidad",
  "contact_info": "Puede contactarnos ante cualquier duda respecto a estos Términos.",
  "contacts": "Contactos",
  "dissatisfaction_policy": "Si el resultado no es satisfactorio, el cliente deberá contactar al salón dentro de los 7 días para analizar posibles soluciones.",
  "general_provisions": "Reglas generales",
  "general_provisions_text": "Estos Términos de uso rigen el uso que usted haga de los Servicios de M Le Diamant. Al utilizar nuestros servicios, usted acepta estos términos.",
  "lastUpdated": "Fecha de la última actualización: {{date}}",
  "last_update_date": "Fecha de la última actualización",
  "late_arrival": "Si el cliente llega más de 15 minutos tarde, el salón tiene derecho a cancelar la cita o acortar el tiempo del procedimiento.",
  "medical_contraindications": "Contraindicaciones médicas",
  "payment_details": "El pago es Realizado en efectivo o con tarjeta después de la prestación de los servicios. El costo de los servicios se indica en la lista de precios y está sujeto a cambios sin previo aviso.",
  "payment_for_services": "Pago de los servicios",
  "privacy_commitment": "Respetamos su privacidad y nos comprometemos a proteger su información personal cuenta con nuestra política de privacidad.",
  "quality_guarantee": "Мы гарантируем качество используемых материалов и профессионализм наших мастеров. Результаты процедуры могут различаться в зависимости от индивидуальных особенностей клиента.",
  "salon_liability": "Если клиент скрывает информацию о медицинских противопоказаниях, салон не несет ответственности за последствия процедур.",
  "sections": {
    "booking": {
      "booking_requirements": "Для регистрации на Процедуры вы должны предоставить действительную контактную информацию. Мы оставляем за собой право подтвердить или отклонить ваше бронирование.",
      "cancellationText": "Клиент может отменить запись не позднее, чем за 24 часа до назначенного времени. При отмене менее чем за 24 часа может взиматься штраф в размере 50% от стоимости услуги.",
      "cancellationTitle": "Отписаться:",
      "title": "2. Бронирование и отмена"
    },
    "changes": {
      "content": "Мы оставляем за собой право изменить настоящие Условия использования в любое время. Изменения вступают в силу с момента их размещения на сайте.",
      "title": "7. Изменение Условий использования"
    },
    "contact": {
      "address": "Адрес",
      "description": "Вы можете связаться с нами по любым вопросам, касающимся настоящих Условий:",
      "email": "Адрес электронной почты",
      "phone": "Teléfono",
      "title": "8. Контакты"
    },
    "general": {
      "content": "Настоящие Условия использования регулируют использование вами Услуг {{salonName}}. Используя наши услуги, вы соглашаетесь с этими условиями.",
      "title": "1. Общие правила"
    },
    "medical": {
      "paragraph1": "Перед процедурой клиент должен сообщить специалисту о медицинских противопоказаниях, аллергии или состоянии здоровья.",
      "paragraph2": "Если клиент скрывает информацию о медицинских противопоказаниях, салон не несет ответственности за последствия процедур.",
      "title": "4. Медицинские противопоказания."
    },
    "payment": {
      "paragraph1": "Оплата производится наличными или картой после оказания услуги. Стоимость услуг указана в прайс-листе и может быть изменена без предварительного уведомления.",
      "paragraph2": "В случае опоздания клиента более чем на 15 минут салон имеет право отменить запись или сократить время процедуры.",
      "title": "3. Оплата услуг"
    },
    "privacy": {
      "content": "Мы уважаем вашу конфиденциальность и обязуемся защищать вашу личную информацию в соответствии с нашей <link>Политикой конфиденциальности</link>.",
      "title": "6. Конфиденциальность"
    },
    "warranty": {
      "paragraph1": "Мы гарантируем качество используемых материалов и профессионализм наших мастеров. Результаты процедуры могут различаться в зависимости от индивидуальных особенностей клиента.",
      "paragraph2": "Если результат не устраивает, клиент должен обратиться в салон в течение 7 дней для обсуждения возможных решений.",
      "title": "5. Гарантии и ответственность"
    }
  },
  "terms_changes": "Изменения в Условиях использования",
  "terms_changes_text": "Мы оставляем за собой право изменить настоящие Условия использования в любое время. Изменения вступают в силу с момента их размещения на сайте.",
  "terms_of_use": "Условия эксплуатации",
  "title": "Условия эксплуатации",
  "warranties_and_liability": "Гарантии и ответственность"
}