{
  "public_reviews": [
    {
      "id": 31,
      "fields": {
        "text_ru": {
          "ru": "Потрясающий салон! Мастера настоящие профессионалы. Маникюр держится больше 3 недель, а результат превосходит все ожидания. Обязательно вернусь!",
          "key": "public_reviews.31.text_ru",
          "en": "Amazing salon! ",
          "ar": "صالون مذهل! السادة محترفون حقيقيون. يدوم المانيكير أكثر من 3 أسابيع والنتيجة فاقت كل التوقعات. سأعود بالتأكيد!",
          "es": "Salón increíble! Los maestros son verdaderos profesionales. La manicura dura más de 3 semanas y el resultado supera todas las expectativas. ¡Definitivamente regresaré!",
          "de": "Toller Salon! Die Meister sind wahre Profis. Die Maniküre dauert mehr als 3 Wochen und das Ergebnis übertrifft alle Erwartungen. Ich komme auf jeden Fall wieder!",
          "fr": "Salon incroyable ! Les maîtres sont de vrais professionnels. La manucure dure plus de 3 semaines et le résultat dépasse toutes les attentes. Je reviendrai certainement!",
          "hi": "अद्भुत सैलून! स्वामी सच्चे पेशेवर हैं। मैनीक्योर 3 सप्ताह से अधिक समय तक चलता है, और परिणाम सभी अपेक्षाओं से अधिक होता है। मैं निश्चित रूप से वापस आऊंगा!",
          "kk": "Таңқаларлық салон! Магистрлер - бұл нағыз мамандар. Маникюр 3 аптадан асады, ал нәтиже барлық күткеннен асып түседі. Мен міндетті түрде ораламын!",
          "pt": "Salão incrível! Os mestres são verdadeiros profissionais. A manicure dura mais de 3 semanas e o resultado supera todas as expectativas. Eu definitivamente voltarei!"
        }
      }
    },
    {
      "id": 32,
      "fields": {
        "text_ru": {
          "ru": "Делала окрашивание волос - результат просто шикарный! Цвет получился именно такой, как я хотела. Спасибо за профессионализм!",
          "key": "public_reviews.32.text_ru",
          "en": "I had my hair dyed and the results were simply gorgeous! ",
          "ar": "لقد صبغت شعري وكانت النتائج رائعة بكل بساطة! تحول اللون بالضبط كما أردت. شكرا على احترافك!",
          "es": "¡Me teñí el cabello y los resultados fueron simplemente maravillosos! El color resultó exactamente como quería. ¡Gracias por tu profesionalismo!",
          "de": "Ich habe meine Haare färben lassen und das Ergebnis war einfach großartig! Die Farbe ist genau so geworden, wie ich es wollte. Vielen Dank für Ihre Professionalität!",
          "fr": "Je me suis fait teindre les cheveux et le résultat était tout simplement magnifique ! La couleur s’est révélée exactement comme je le souhaitais. Merci pour votre professionnalisme !",
          "hi": "मैंने अपने बाल रंगे थे और परिणाम बेहद खूबसूरत थे! रंग बिल्कुल वैसा निकला जैसा मैं चाहता था। आपकी व्यावसायिकता के लिए धन्यवाद!",
          "kk": "Мен шашымды боялдым, нәтижелер керемет болды! Түс менің қалағанымды дәл шықты. Кәсіби шеберлік үшін рахмет!",
          "pt": "Pintei meu cabelo e o resultado foi simplesmente lindo! A cor ficou exatamente como eu queria. Obrigado pelo seu profissionalismo!"
        }
      }
    },
    {
      "id": 33,
      "fields": {
        "text_ru": {
          "ru": "Лучший салон в городе! Атмосфера уютная, мастера внимательные. Особенно понравился макияж на свадьбу - держался весь день и выглядел безупречно.",
          "key": "public_reviews.33.text_ru",
          "en": "The best salon in town! ",
          "ar": "أفضل صالون في المدينة! الجو مريح والحرفيون منتبهون. أعجبني بشكل خاص مكياج الزفاف - فقد استمر طوال اليوم وبدا خاليًا من العيوب.",
          "es": "¡El mejor salón de la ciudad! El ambiente es acogedor, los artesanos atentos. Me gustó especialmente el maquillaje para la boda: duró todo el día y lució impecable.",
          "de": "Der beste Salon der Stadt! Die Atmosphäre ist gemütlich, die Handwerker aufmerksam. Besonders gut hat mir das Make-up für die Hochzeit gefallen – es hielt den ganzen Tag und sah makellos aus.",
          "fr": "Le meilleur salon de la ville ! L'ambiance est cosy, les artisans sont attentifs. J'ai particulièrement aimé le maquillage pour le mariage - il a tenu toute la journée et avait l'air impeccable.",
          "hi": "शहर में सबसे अच्छा सैलून! माहौल आरामदायक है, कारीगर चौकस हैं। मुझे विशेष रूप से शादी के लिए मेकअप पसंद आया - यह पूरे दिन टिका रहा और दोषरहित दिख रहा था।",
          "kk": "Қаладағы ең жақсы салон! Атмосфера жайлы, қолөнершілер мұқият. Маған әсіресе үйлену тойына макияж ұнады - ол күні бойы созылды және мінсіз көрінді.",
          "pt": "O melhor salão da cidade! O ambiente é aconchegante, os artesãos são atenciosos. Gostei especialmente da maquiagem para o casamento - durou o dia todo e ficou impecável."
        }
      }
    },
    {
      "id": 34,
      "fields": {
        "text_ru": {
          "ru": "Хожу в этот салон уже год. Всегда довольна результатом! Цены адекватные, качество на высоте. Рекомендую всем подругам!",
          "key": "public_reviews.34.text_ru",
          "en": "I've been going to this salon for a year now. ",
          "ar": "لقد ذهبت إلى هذا الصالون لمدة عام الآن. سعيد دائما بالنتيجة! الأسعار معقولة، والجودة ممتازة. أوصي به لجميع أصدقائي!",
          "es": "Llevo un año yendo a este salón. ¡Siempre feliz con el resultado! Los precios son razonables, la calidad es excelente. ¡Se lo recomiendo a todos mis amigos!",
          "de": "Ich gehe jetzt seit einem Jahr in diesen Salon. Immer zufrieden mit dem Ergebnis! Die Preise sind angemessen, die Qualität ist ausgezeichnet. Ich empfehle es allen meinen Freunden!",
          "fr": "Cela fait maintenant un an que je vais dans ce salon. Toujours content du résultat ! Les prix sont raisonnables, la qualité est excellente. Je le recommande à tous mes amis !",
          "hi": "मैं अब एक साल से इस सैलून में जा रहा हूं। परिणाम से हमेशा खुश! कीमतें उचित हैं, गुणवत्ता उत्कृष्ट है। मैं अपने सभी दोस्तों को इसकी अनुशंसा करता हूँ!",
          "kk": "Мен қазір осы салонға бардым. Нәтижеге әрқашан риза! Бағалар орынды, сапасы өте жақсы. Мен оны барлық достарыма ұсынамын!",
          "pt": "Frequento esse salão há um ano. Sempre feliz com o resultado! Os preços são razoáveis, a qualidade é excelente. Recomendo a todos os meus amigos!"
        }
      }
    },
    {
      "id": 35,
      "fields": {
        "text_ru": {
          "ru": "Прекрасный сервис! Записалась онлайн за пару минут, пришла вовремя, без ожидания. Мастер сделала все быстро и качественно. Очень довольна!",
          "key": "public_reviews.35.text_ru",
          "en": "Great service! ",
          "ar": "خدمة رائعة! لقد قمت بتحديد موعد عبر الإنترنت في بضع دقائق، ووصلت في الوقت المحدد، دون انتظار. لقد فعل السيد كل شيء بسرعة وكفاءة. سعيد جدا!",
          "es": "¡Gran servicio! Pedí cita online en un par de minutos, llegué puntual, sin esperas. El maestro hizo todo de forma rápida y eficiente. ¡Muy contento!",
          "de": "Toller Service! Ich habe innerhalb weniger Minuten online einen Termin vereinbart und bin pünktlich und ohne Wartezeit angekommen. Der Meister hat alles schnell und effizient erledigt. Sehr zufrieden!",
          "fr": "Excellent service ! J'ai pris rendez-vous en ligne en quelques minutes, je suis arrivé à l'heure, sans attendre. Le maître a tout fait rapidement et efficacement. Très content!",
          "hi": "बढ़िया सेवा! मैंने कुछ ही मिनटों में ऑनलाइन अपॉइंटमेंट ले ली और बिना इंतज़ार किए समय पर पहुंच गया। गुरु ने सब कुछ जल्दी और कुशलता से किया। बहुत खुश!",
          "kk": "Тамаша қызмет! Мен бір-екі минуттан кейін кездесуді бір-екі минутта жасадым, уақытында келдім. Шебер бәрін тез және тиімді жасады. Өте риза!",
          "pt": "Ótimo serviço! Marquei consulta online em alguns minutos, cheguei na hora certa, sem esperar. O mestre fez tudo com rapidez e eficiência. Muito satisfeito!"
        }
      }
    },
    {
      "id": 36,
      "fields": {
        "text_ru": {
          "ru": "Делала педикюр и маникюр - все на высшем уровне! Стерильность, качественные материалы, приятная атмосфера. Буду ходить только сюда!",
          "key": "public_reviews.36.text_ru",
          "en": "I had a pedicure and manicure - everything was top notch! ",
          "ar": "لقد حصلت على باديكير وأظافر - كل شيء كان على أعلى مستوى! العقم والمواد عالية الجودة والجو اللطيف. سأذهب هنا فقط!",
          "es": "Me hice pedicura y manicura, ¡todo fue de primera! Esterilidad, materiales de calidad, ambiente agradable. ¡Solo iré aquí!",
          "de": "Ich hatte eine Pediküre und eine Maniküre – alles war erstklassig! Sterilität, hochwertige Materialien, angenehme Atmosphäre. Ich werde nur hierher gehen!",
          "fr": "J'ai eu une pédicure et une manucure - tout était excellent ! Stérilité, matériaux de qualité, ambiance agréable. Je n'irai qu'ici !",
          "hi": "मैंने पेडीक्योर और मैनीक्योर करवाया - सब कुछ उत्तम दर्जे का था! बाँझपन, गुणवत्तापूर्ण सामग्री, सुखद वातावरण। मैं तो यहीं जाऊँगा!",
          "kk": "Менде педикюр мен маникюр болды - бәрі жақсы болды! Стерилділік, сапалы материалдар, жағымды атмосфера. Мен тек осында жүремін!",
          "pt": "Fiz pedicure e manicure - tudo foi de primeira qualidade! Esterilidade, materiais de qualidade, ambiente agradável. Eu só irei aqui!"
        }
      }
    }
  ]
}