{
  "users": [
    {
      "id": 5,
      "fields": {
        "full_name": {
          "ru": "Касымова Гульчере",
          "key": "users.5.full_name.f27f2d3f",
          "en": "Kasymova Gulcehre",
          "ar": "كاسيموفا جولشير",
          "es": "Kasymova Gulcehre",
          "de": "Kasymova Gulcehre",
          "fr": "Kasymova Gulcehre",
          "hi": "कासिमोवा गुलसेरे",
          "kk": "Қасымова Гүлчехре",
          "pt": "Kasymova Gulcehre",
          "detected_language": "tk"
        },
        "bio": {
          "ru": "Мастер преображения ваших волос. Kasymova Gulcehre использует авторские техники окрашивания и ухода, которые подчеркнут вашу индивидуальность.",
          "key": "users.5.bio.c222fb47",
          "en": "Master of transforming your hair. ",
          "ar": "سيد تحويل شعرك. تستخدم Kasymova Gulcehre تقنيات التلوين والعناية الأصلية التي ستسلط الضوء على شخصيتك.",
          "es": "Maestro en transformar tu cabello. Kasymova Gulcehre utiliza técnicas originales de coloración y cuidado que resaltarán su individualidad.",
          "de": "Meister der Transformation Ihrer Haare. Kasymova Gulcehre verwendet originelle Färbe- und Pflegetechniken, die Ihre Individualität hervorheben.",
          "fr": "Maître de la transformation de vos cheveux. Kasymova Gulcehre utilise des techniques de coloration et de soins originales qui mettront en valeur votre individualité.",
          "hi": "अपने बालों को बदलने में माहिर. कासिमोवा गुलसेरे मूल रंग और देखभाल तकनीकों का उपयोग करती है जो आपके व्यक्तित्व को उजागर करेगी।",
          "kk": "Шашыңызды түрлендіру шебері. Қасымова Гүлчехре сіздің даралығыңызды көрсететін түпнұсқа бояу мен күтім әдістерін пайдаланады.",
          "pt": "Mestre em transformar seus cabelos. Kasymova Gulcehre utiliza técnicas originais de coloração e cuidado que irão destacar a sua individualidade.",
          "detected_language": "ru"
        }
      }
    },
    {
      "id": 2,
      "fields": {
        "full_name": {
          "ru": "Мохамед Сабри",
          "key": "users.2.full_name.62f98641",
          "en": "Mohamed Sabri",
          "ar": "محمد صبري",
          "es": "Mohamed Sabri",
          "de": "Mohamed Sabri",
          "fr": "Mohamed Sabri",
          "hi": "मोहम्मद साबरी",
          "kk": "Мохамед Сабри",
          "pt": "Mohamed Sabri",
          "detected_language": "id"
        },
        "bio": {
          "ru": "Мастер преображения ваших волос. Mohamed Sabri использует авторские техники окрашивания и ухода, которые подчеркнут вашу индивидуальность.",
          "key": "users.2.bio.adf4d163",
          "en": "Master of transforming your hair. ",
          "ar": "سيد تحويل شعرك. يستخدم محمد صبري تقنيات التلوين والعناية المميزة التي من شأنها إبراز شخصيتك.",
          "es": "Maestro en transformar tu cabello. Mohamed Sabri utiliza técnicas exclusivas de coloración y cuidado que resaltarán su individualidad.",
          "de": "Meister der Transformation Ihrer Haare. Mohamed Sabri verwendet charakteristische Färbe- und Pflegetechniken, die Ihre Individualität hervorheben.",
          "fr": "Maître de la transformation de vos cheveux. Mohamed Sabri utilise des techniques de coloration et de soins signatures qui mettront en valeur votre individualité.",
          "hi": "अपने बालों को बदलने में माहिर. मोहम्मद साबरी सिग्नेचर कलरिंग और देखभाल तकनीकों का उपयोग करते हैं जो आपके व्यक्तित्व को उजागर करेंगे।",
          "kk": "Шашыңызды түрлендіру шебері. Мохамед Сабри сіздің даралығыңызды көрсететін қолтаңба бояуы мен күтім әдістерін пайдаланады.",
          "pt": "Mestre em transformar seus cabelos. Mohamed Sabri usa técnicas exclusivas de coloração e cuidado que irão destacar sua individualidade.",
          "detected_language": "ru"
        }
      }
    },
    {
      "id": 6,
      "fields": {
        "full_name": {
          "ru": "Перадилья Дженнифер",
          "key": "users.6.full_name.91ca242b",
          "en": "Peradilla Jennifer",
          "ar": "بيراديلا جنيفر",
          "es": "Peradilla Jennifer",
          "de": "Peradilla Jennifer",
          "fr": "Peradilla Jennifer",
          "hi": "पेराडिला जेनिफ़र",
          "kk": "Перадилла Дженнифер",
          "pt": "Peradilla Jennifer",
          "detected_language": "id"
        },
        "bio": {
          "ru": "Мастер преображения ваших волос. Peradilla Jennifer использует авторские техники окрашивания и ухода, которые подчеркнут вашу индивидуальность.",
          "key": "users.6.bio.73df12e0",
          "en": "Master of transforming your hair. ",
          "ar": "سيد تحويل شعرك. تستخدم بيراديلا جينيفر تقنيات التلوين والعناية الخاصة التي ستسلط الضوء على شخصيتك.",
          "es": "Maestro en transformar tu cabello. Peradilla Jennifer utiliza técnicas patentadas de coloración y cuidado que resaltarán su individualidad.",
          "de": "Meister der Transformation Ihrer Haare. Peradilla Jennifer verwendet proprietäre Färbe- und Pflegetechniken, die Ihre Individualität hervorheben.",
          "fr": "Maître de la transformation de vos cheveux. Peradilla Jennifer utilise des techniques exclusives de coloration et de soins qui mettront en valeur votre individualité.",
          "hi": "अपने बालों को बदलने में माहिर. पेराडिला जेनिफ़र मालिकाना रंग और देखभाल तकनीकों का उपयोग करती है जो आपके व्यक्तित्व को उजागर करेगी।",
          "kk": "Шашыңызды түрлендіру шебері. Перадилла Дженнифер сіздің даралығыңызды көрсететін жеке бояу мен күтім әдістерін пайдаланады.",
          "pt": "Mestre em transformar seus cabelos. Peradilla Jennifer usa técnicas proprietárias de coloração e cuidado que irão destacar sua individualidade.",
          "detected_language": "ru"
        }
      }
    },
    {
      "id": 4,
      "fields": {
        "full_name": {
          "ru": "Kozhabay Lyazat",
          "key": "users.4.full_name.7e09288f",
          "en": "Kozhabay Lyazat",
          "ar": "كوزباي ليازات",
          "es": "Kozhabay Lyazat",
          "de": "Kozhabay Lyazat",
          "fr": "Kozhabay Lyazat",
          "hi": "कोझाबे ल्याज़त",
          "kk": "Қожабай Ләзат",
          "pt": "Kozhabay Lyazat",
          "detected_language": "ru"
        },
        "bio": {
          "ru": "Мастер преображения ваших волос. Kozhabay Lyazat использует авторские техники окрашивания и ухода, которые подчеркнут вашу индивидуальность.",
          "key": "users.4.bio.8aed439c",
          "en": "Master of transforming your hair. ",
          "ar": "سيد تحويل شعرك. يستخدم Kozhabay Lyazat تقنيات التلوين والعناية الخاصة التي ستسلط الضوء على شخصيتك.",
          "es": "Maestro en transformar tu cabello. Kozhabay Lyazat utiliza técnicas patentadas de coloración y cuidado que resaltarán su individualidad.",
          "de": "Meister der Transformation Ihrer Haare. Kozhabay Lyazat verwendet proprietäre Färbe- und Pflegetechniken, die Ihre Individualität hervorheben.",
          "fr": "Maître de la transformation de vos cheveux. Kozhabay Lyazat utilise des techniques de coloration et de soins exclusives qui mettront en valeur votre individualité.",
          "hi": "अपने बालों को बदलने में माहिर. Kozhabay Lyazat मालिकाना रंग और देखभाल तकनीकों का उपयोग करता है जो आपके व्यक्तित्व को उजागर करेगा।",
          "kk": "Шашыңызды түрлендіру шебері. Қожабай Ләзат сіздің даралығыңызды көрсететін жеке бояу мен күтім әдістерін пайдаланады.",
          "pt": "Mestre em transformar seus cabelos. Kozhabay Lyazat usa técnicas proprietárias de coloração e cuidado que irão destacar sua individualidade.",
          "detected_language": "ru"
        }
      }
    },
    {
      "id": 3,
      "fields": {
        "full_name": {
          "ru": "Amandurdyyeva Mestan",
          "key": "users.3.full_name.fffd05a4",
          "en": "Amandurdyyeva Mestan",
          "ar": "أماندوردييفا ميستان",
          "es": "Amandurdyyeva Mestan",
          "de": "Amandurdyyeva Mestan",
          "fr": "Amandurdyyeva Mestan",
          "hi": "अमान्दुर्दयेवा मेस्तान",
          "kk": "Амандұрдыева Местан",
          "pt": "Amandurdyyeva Mestan",
          "detected_language": "ru"
        },
        "bio": {
          "ru": "Мастер преображения ваших волос. Amandurdyyeva Mestan использует авторские техники окрашивания и ухода, которые подчеркнут вашу индивидуальность.",
          "key": "users.3.bio.19fa98cd",
          "en": "Master of transforming your hair. ",
          "ar": "سيد تحويل شعرك. تستخدم Amandurdyyeva Mestan تقنيات التلوين والعناية الخاصة التي ستسلط الضوء على شخصيتك.",
          "es": "Maestro en transformar tu cabello. Amandurdyyeva Mestan utiliza técnicas patentadas de coloración y cuidado que resaltarán su individualidad.",
          "de": "Meister der Transformation Ihrer Haare. Amandurdyyeva Mestan verwendet proprietäre Färbe- und Pflegetechniken, die Ihre Individualität hervorheben.",
          "fr": "Maître de la transformation de vos cheveux. Amandurdyyeva Mestan utilise des techniques de coloration et de soins exclusives qui mettront en valeur votre individualité.",
          "hi": "अपने बालों को बदलने में माहिर. अमान्दुर्देयेवा मेस्टन मालिकाना रंग और देखभाल तकनीकों का उपयोग करता है जो आपके व्यक्तित्व को उजागर करेगा।",
          "kk": "Шашыңызды түрлендіру шебері. Амандурдыева Местан сіздің даралығыңызды көрсететін жеке бояу мен күтім әдістерін пайдаланады.",
          "pt": "Mestre em transformar seus cabelos. Amandurdyyeva Mestan usa técnicas proprietárias de coloração e cuidado que irão destacar sua individualidade.",
          "detected_language": "ru"
        }
      }
    }
  ],
  "public_reviews": [
    {
      "id": 1,
      "fields": {
        "employee_position": {
          "ru": "Перманентный макияж",
          "key": "public_reviews.1.employee_position.4075aad3",
          "en": "Permanent Makeup",
          "ar": "مكياج دائم",
          "es": "Maquillaje Permanente",
          "de": "Permanentes Make-up",
          "fr": "Maquillage permanent",
          "hi": "स्थायी श्रृंगार",
          "kk": "Тұрақты макияж",
          "pt": "Maquiagem Permanente",
          "detected_language": "en"
        }
      }
    },
    {
      "id": 2,
      "fields": {
        "employee_position": {
          "ru": "Ресницы",
          "key": "public_reviews.2.employee_position.5b1b1d5e",
          "en": "Eyelashes",
          "ar": "الرموش",
          "es": "Pestañas",
          "de": "Wimpern",
          "fr": "Cils",
          "hi": "पलकें",
          "kk": "Кірпіктер",
          "pt": "Pestanas",
          "detected_language": "en"
        }
      }
    },
    {
      "id": 3,
      "fields": {
        "employee_position": {
          "ru": "Маникюр и педикюр",
          "key": "public_reviews.3.employee_position.8e5cfdfa",
          "en": "Manicure & Pedicure",
          "ar": "مانيكير وباديكير",
          "es": "Manicura y Pedicura",
          "de": "Maniküre und Pediküre",
          "fr": "Manucure et Pédicure",
          "hi": "मैनीक्योर और पेडीक्योर",
          "kk": "Маникюр және педикюр",
          "pt": "Manicura e Pedicura",
          "detected_language": "en"
        }
      }
    },
    {
      "id": 4,
      "fields": {
        "employee_position": {
          "ru": "Уход за лицом",
          "key": "public_reviews.4.employee_position.9a3a91ca",
          "en": "Facial Treatment",
          "ar": "علاج الوجه",
          "es": "Tratamiento Facial",
          "de": "Gesichtsbehandlung",
          "fr": "Traitement du visage",
          "hi": "चेहरे का उपचार",
          "kk": "Бет күтімі",
          "pt": "Tratamento Facial",
          "detected_language": "en"
        }
      }
    },
    {
      "id": 5,
      "fields": {
        "employee_position": {
          "ru": "Микроблейдинг",
          "key": "public_reviews.5.employee_position.65d6c03d",
          "en": "Microblading",
          "ar": "ميكروبليدينج",
          "es": "microblading",
          "de": "Microblading",
          "fr": "Microblading",
          "hi": "माइक्रोब्लैडिंग",
          "kk": "Микроблейдинг",
          "pt": "Microblading",
          "detected_language": "en"
        }
      }
    }
  ]
}