{
  "items": [
    {
      "bio": "Гуля — признанный эксперт в области маникюра, депиляции и профессионального ухода за лицом с 8-летним опытом. Благодаря совершенному владению техниками эстетического преображения и вниманию к деталям, она создает безупречные образы, обеспечивая каждому клиенту высочайший уровень заботы и профессиональный подход.",
      "id": 1,
      "name": "Қасимова Гүлчехре",
      "photo": "",
      "position": "Маникюр және депиляция шебері"
    },
    {
      "bio": "Дженнифер воплощает в себе талант многопрофильного специалиста. Она виртуозно выполняет как базовые, так и сложные бьюти-процедуры, обеспечивая комплексный и гармоничный подход к вашему преображению.",
      "id": 2,
      "name": "Перадилла Дженнифер",
      "photo": "",
      "position": "Мастер универсальной красоты"
    },
    {
      "bio": "Местан — уникальный мастер, сочетающий в себе талант топ-стилиста и эксперта по перманентному макияжу. Ее глубокие знания позволяют создавать законченные и безупречные образы, подчеркивающие вашу индивидуальность.",
      "id": 3,
      "name": "Амандұрдыева Местан",
      "photo": "",
      "position": "шаш стилисті және тұрақты макияж суретшісі"
    },
    {
      "bio": "Симо является ведущим экспертом нашего салона в области премиального ухода и сложного колорирования. Его многолетний международный опыт и авторские методики гарантируют результат высочайшего класса.",
      "id": 4,
      "name": "Мохаммед Сабри",
      "photo": "",
      "position": "шаш стилисті"
    },
    {
      "bio": "Лязат — истинный перфекционист в индустрии ногтевого сервиса. Обладая безупречным вкусом и вниманием к деталям, она создает идеальный Маникюр и Педикюр, заботясь об эстетике и здоровье ваших рук.",
      "id": 5,
      "name": "Қожабай Ләзат",
      "photo": "",
      "position": "Мастер маникюра"
    },
    {
      "bio": "",
      "id": 6,
      "name": "Турсунай",
      "photo": "",
      "position": "Меншік иесі/директор"
    },
    {
      "bio": "",
      "id": 7,
      "name": "Z7 Жүйе әкімшісі Сынақ маникюрі CSV-ден импортталған Күтім бойынша ұсыныстар Код автоматты түрде жасалады және достарды шақыру үшін пайдаланылады. Сіздің сілтеме кодыңыз a <z1C>1C Шақырулар тарихы Әрбір қызмет санаты үшін ұпай коэффициентін теңшеу Коэффицент тек таңдалған санатқа қолданылады. Ереже өшірілсе, x1 базалық мөлшерлемесі қолданылады. Есептеу коэффициенті Санат бойынша есептеу ережелері Белсенді емес деңгей артықшылықтарды автоматты түрде есептеуге қатыспайды. Деңгей күйі негізгі ереже өшірілген f есептеу x1 санаты үшін қолданылады. Ереже күйі Белсенді емес Бонус бағдарламасы Жарнамалық кодты өңдеу Барлық аймақтар Мин. рекордтық сома ([[[V0]]]) Белгілі санаттар Белгілі бір клиенттер Белгілі қызметтер A-Z коды бойынша Жеңілдік бойынша z5st newst Қолдану арқылы Кемінде бір қызмет санатын таңдаңыз Кемінде бір клиентті таңдаңыз Қолдану аясы Кемінде бір қызметті таңдаңыз Промо-код жаңартылды amp2]a[4>z және бонустар Шақыру журналы Тұтынушы мәзірінің параметрлері Таңдалған тарих жазбаларын жою қажет пе? Таңдалғанды жою ([[[V0]]]) Таңдалғанды жою ([[[V0]]]) Таңдалғанды жою ([[)</z4] Таңдалған ([[[V0]]]) Таңдалғанды жою ([[[V0]]]) Үлгіні өңдеу Жойылған жазбалар: [[[V0]]] Жойылған жазбалар: [[[V0]]] [[[V0]]] Жойылған жазбалар: [[[V0]]] Үлгілерді басқару Ешқандай үлгі әлі жасалмады Үлгі кірістірілді Мына Temp Enter үлгі? Кірістіру Үлгі атын енгізіңіз Дайын үлгі Үлгі таңдаңыз Жүйе Жүйе үлгісін жою және жою мүмкін емес жылдам жіберуге арналған үлгілер Жолдау үлгілері Барлық клиенттер Тек таңдалған клиенттер Жасырын элементтерді кімге қолдану керек Өшірілген элементтер клиенттің жеке есептік жазбасында жоғалады",
      "photo": "",
      "position": "Жүйе әкімшісі"
    }
  ]
}