{
  "booking_and_cancellation": "الحجوزات والإلغاءات",
  "booking_requirements": "للتسجيل العلاجات، يجب عليك تقديم معلومات اتصال صالحة. نحن نحتفظ بالحق في تأكيد حجزك أو رفضه.",
  "cancellation_policy": "سياسة الإلغاء",
  "cancellation_policy_text": "يجوز للعميل إلغاء الموعد حتى 24 ساعة قبل الوقت المحدد. إذا تم الإلغاء قبل أقل من 24 ساعة، فقد يتم فرض غرامة قدرها 50% من تكلفة الخدمة.",
  "client_obligations": "قبل الإجراء، يجب على العميل إبلاغ الأخصائي بالموانع الطبية أو الحساسية أو الحالات الصحية.",
  "confidentiality": "السرية",
  "contact_info": "يمكنك الاتصال بنا بخصوص أي أسئلة بخصوص هذه الشروط.",
  "contacts": "جهات الاتصال",
  "dissatisfaction_policy": "إذا كانت النتيجة غير مرضية، يجب على العميل الاتصال بالصالون خلال 7 أيام لمناقشة الحلول الممكنة.",
  "general_provisions": "القواعد العامة",
  "general_provisions_text": "تحكم شروط الاستخدام هذه استخدامك لخدمات M Le Diamant. باستخدام خدماتنا، فإنك توافق على هذه الشروط.",
  "lastUpdated": "تاريخ آخر تحديث: {{date}}",
  "last_update_date": "تاريخ آخر تحديث",
  "late_arrival": "إذا تأخر العميل أكثر من 15 دقيقة، يحق للصالون إلغاء الموعد أو تقصير وقت الإجراء.",
  "medical_contraindications": "الموانع الطبية",
  "payment_details": "Оплата производится наличными или картой после оказания услуги. Стоимость услуг указана в прайс-листе и может быть изменена без предварительного уведомления.",
  "payment_for_services": "Оплата услуг",
  "privacy_commitment": "Мы уважаем вашу конфиденциальность и обязуемся защищать вашу личную информацию в соответствии с нашей политикой конфиденциальности.",
  "quality_guarantee": "Мы гарантируем качество используемых материалов и профессионализм наших мастеров. Результаты процедуры могут различаться в зависимости от индивидуальных особенностей клиента.",
  "salon_liability": "Если клиент скрывает информацию о медицинских противопоказаниях, салон не несет ответственности за последствия процедур.",
  "sections": {
    "booking": {
      "booking_requirements": "Для регистрации на Процедуры вы должны предоставить действительную контактную информацию. Мы оставляем за собой право подтвердить или отклонить ваше бронирование.",
      "cancellationText": "Клиент может отменить запись не позднее, чем за 24 часа до назначенного времени. При отмене менее чем за 24 часа может взиматься штраф в размере 50% от стоимости услуги.",
      "cancellationTitle": "Отписаться:",
      "title": "2. Бронирование и отмена"
    },
    "changes": {
      "content": "Мы оставляем за собой право изменить настоящие Условия использования в любое время. Изменения вступают в силу с момента их размещения на сайте.",
      "title": "7. Изменение Условий использования"
    },
    "contact": {
      "address": "العنوان",
      "description": "Вы можете связаться с нами по любым вопросам, касающимся настоящих Условий:",
      "email": "عنوان البريد الإلكتروني",
      "phone": "الهاتف",
      "title": "8. Контакты"
    },
    "general": {
      "content": "Настоящие Условия использования регулируют использование вами Услуг {{salonName}}. Используя наши услуги, вы соглашаетесь с этими условиями.",
      "title": "1. Общие правила"
    },
    "medical": {
      "paragraph1": "Перед процедурой клиент должен сообщить специалисту о медицинских противопоказаниях, аллергии или состоянии здоровья.",
      "paragraph2": "Если клиент скрывает информацию о медицинских противопоказаниях, салон не несет ответственности за последствия процедур.",
      "title": "4. Медицинские противопоказания."
    },
    "payment": {
      "paragraph1": "Оплата производится наличными или картой после оказания услуги. Стоимость услуг указана в прайс-листе и может быть изменена без предварительного уведомления.",
      "paragraph2": "В случае опоздания клиента более чем на 15 минут салон имеет право отменить запись или сократить время процедуры.",
      "title": "3. Оплата услуг"
    },
    "privacy": {
      "content": "Мы уважаем вашу конфиденциальность и обязуемся защищать вашу личную информацию в соответствии с нашей <link>Политикой конфиденциальности</link>.",
      "title": "6. Конфиденциальность"
    },
    "warranty": {
      "paragraph1": "Мы гарантируем качество используемых материалов и профессионализм наших мастеров. Результаты процедуры могут различаться в зависимости от индивидуальных особенностей клиента.",
      "paragraph2": "Если результат не устраивает, клиент должен обратиться в салон в течение 7 дней для обсуждения возможных решений.",
      "title": "5. Гарантии и ответственность"
    }
  },
  "terms_changes": "Изменения в Условиях использования",
  "terms_changes_text": "Мы оставляем за собой право изменить настоящие Условия использования в любое время. Изменения вступают в силу с момента их размещения на сайте.",
  "terms_of_use": "Условия эксплуатации",
  "title": "Условия эксплуатации",
  "warranties_and_liability": "Гарантии и ответственность"
}