{
  "items": [
    {
      "id": 1,
      "name": "Kasymova Gulchekhre",
      "position": "Mestre em unhas e Depilação com cera",
      "bio": "Gulya é uma especialista reconhecida na área de manicure, depilação e cuidados faciais profissionais com 8 anos de experiência. Através do seu domínio das técnicas de transformação estética e da atenção aos detalhes, ela cria imagens impecáveis, proporcionando a cada cliente o mais alto nível de cuidado e abordagem profissional.",
      "photo": ""
    },
    {
      "id": 2,
      "name": "Peradilla Jennifer",
      "position": "Universal Beauty Master",
      "bio": "Jennifer personifica o talento de uma profissional multidisciplinar. Ela executa com maestria procedimentos de beleza básicos e complexos, proporcionando uma abordagem abrangente e harmoniosa para sua transformação.",
      "photo": ""
    },
    {
      "id": 3,
      "name": "Amandurdyyeva Mestan",
      "position": "Cabeleireiro e maquiador permanente",
      "bio": "Mestan é um mestre único que combina o talento de um estilista de ponta e um especialista em maquiagem permanente. Seu profundo conhecimento permite criar imagens completas e impecáveis ​​que destacam sua individualidade.",
      "photo": ""
    },
    {
      "id": 4,
      "name": "Mokhammed Sabri",
      "position": "Cabeleireiro",
      "bio": "Simo é o maior especialista do nosso salão na área de cuidados premium e coloração complexa. Seus muitos anos de experiência internacional e técnicas proprietárias garantem resultados da mais alta classe.",
      "photo": ""
    },
    {
      "id": 5,
      "name": "Kozhabay Lyazat",
      "position": "Nail Master",
      "bio": "Lyazat é um verdadeiro perfeccionista na indústria de manicure. Com gosto impecável e atenção aos detalhes, ela cria a manicure e a pedicure perfeitas, cuidando da estética e da saúde das suas mãos.",
      "photo": ""
    },
    {
      "id": 6,
      "name": "Tursunai",
      "position": "Proprietário / Diretor",
      "bio": "",
      "photo": ""
    },
    {
      "id": 7,
      "name": "Administrador",
      "position": "Administrador do sistema",
      "bio": "",
      "photo": ""
    }
  ]
}