{
  "booking_and_cancellation": "आरक्षण और रद्दीकरण",
  "booking_requirements": "उपचार के लिए पंजीकरण करने के लिए, आपको अवश्य ही वैध संपर्क जानकारी प्रदान करें. हम आपकी बुकिंग की पुष्टि या अस्वीकार करने का अधिकार सुरक्षित रखते हैं।",
  "cancellation_policy": "रद्दीकरण नीति",
  "cancellation_policy_text": "ग्राहक निर्धारित समय से 24 घंटे पहले तक नियुक्ति रद्द कर सकता है। यदि 24 घंटे से कम समय पहले रद्द किया जाता है, तो सेवा की लागत का 50% जुर्माना लगाया जा सकता है।",
  "client_obligations": "प्रक्रिया से पहले, ग्राहक को विशेषज्ञ को चिकित्सा मतभेद, एलर्जी या स्वास्थ्य स्थितियों के बारे में सूचित करना होगा।",
  "confidentiality": "गोपनीयता",
  "contact_info": "आप इन शर्तों के संबंध में किसी भी प्रश्न के लिए हमसे संपर्क कर सकते हैं।",
  "contacts": "संपर्क",
  "dissatisfaction_policy": "यदि परिणाम संतोषजनक नहीं है, तो ग्राहक संभावित समाधानों पर चर्चा करने के लिए 7 दिनों के भीतर सैलून से संपर्क करना चाहिए।",
  "general_provisions": "सामान्य नियम",
  "general_provisions_text": "उपयोग की ये शर्तें एम ले डायमेंट सेवाओं के आपके उपयोग को नियंत्रित करती हैं। हमारी सेवाओं का उपयोग करके, आप इन शर्तों से सहमत हैं।",
  "lastUpdated": "अंतिम अद्यतन की तिथि: {{date}}",
  "last_update_date": "अंतिम अद्यतन की तिथि",
  "late_arrival": "यदि ग्राहक 15 मिनट से अधिक देर से आता है, तो सैलून को नियुक्ति रद्द करने या प्रक्रिया के समय को कम करने का अधिकार है।",
  "medical_contraindications": "चिकित्सा मतभेद",
  "payment_details": "Оплата производится наличными или картой после оказания услуги. Стоимость услуг указана в прайс-листе и может быть изменена без предварительного уведомления.",
  "payment_for_services": "Оплата услуг",
  "privacy_commitment": "Мы уважаем вашу конфиденциальность и обязуемся защищать вашу личную информацию в соответствии с нашей политикой конфиденциальности.",
  "quality_guarantee": "Мы гарантируем качество используемых материалов и профессионализм наших мастеров. Результаты процедуры могут различаться в зависимости от индивидуальных особенностей клиента.",
  "salon_liability": "Если клиент скрывает информацию о медицинских противопоказаниях, салон не несет ответственности за последствия процедур.",
  "sections": {
    "booking": {
      "booking_requirements": "Для регистрации на Процедуры вы должны предоставить действительную контактную информацию. Мы оставляем за собой право подтвердить или отклонить ваше бронирование.",
      "cancellationText": "Клиент может отменить запись не позднее, чем за 24 часа до назначенного времени. При отмене менее чем за 24 часа может взиматься штраф в размере 50% от стоимости услуги.",
      "cancellationTitle": "Отписаться:",
      "title": "2. Бронирование и отмена"
    },
    "changes": {
      "content": "Мы оставляем за собой право изменить настоящие Условия использования в любое время. Изменения вступают в силу с момента их размещения на сайте.",
      "title": "7. Изменение Условий использования"
    },
    "contact": {
      "address": "पता",
      "description": "Вы можете связаться с нами по любым вопросам, касающимся настоящих Условий:",
      "email": "ईमेल पता",
      "phone": "फोन",
      "title": "8. Контакты"
    },
    "general": {
      "content": "उपयोग की ये शर्तें आपके द्वारा {{salonName}} सेवाओं के उपयोग को नियंत्रित करती हैं। हमारी सेवाओं का उपयोग करके आप इन शर्तों से सहमत हैं।",
      "title": "1. Общие правила"
    },
    "medical": {
      "paragraph1": "Перед процедурой клиент должен сообщить специалисту о медицинских противопоказаниях, аллергии или состоянии здоровья.",
      "paragraph2": "Если клиент скрывает информацию о медицинских противопоказаниях, салон не несет ответственности за последствия процедур.",
      "title": "4. Медицинские противопоказания."
    },
    "payment": {
      "paragraph1": "Оплата производится наличными или картой после оказания услуги. Стоимость услуг указана в прайс-листе и может быть изменена без предварительного уведомления.",
      "paragraph2": "В случае опоздания клиента более чем на 15 минут салон имеет право отменить запись или сократить время процедуры.",
      "title": "3. Оплата услуг"
    },
    "privacy": {
      "content": "Мы уважаем вашу конфиденциальность и обязуемся защищать вашу личную информацию в соответствии с нашей <link>Политикой конфиденциальности</link>.",
      "title": "6. Конфиденциальность"
    },
    "warranty": {
      "paragraph1": "Мы гарантируем качество используемых материалов и профессионализм наших мастеров. Результаты процедуры могут различаться в зависимости от индивидуальных особенностей клиента.",
      "paragraph2": "Если результат не устраивает, клиент должен обратиться в салон в течение 7 дней для обсуждения возможных решений.",
      "title": "5. Гарантии и ответственность"
    }
  },
  "terms_changes": "Изменения в Условиях использования",
  "terms_changes_text": "Мы оставляем за собой право изменить настоящие Условия использования в любое время. Изменения вступают в силу с момента их размещения на сайте.",
  "terms_of_use": "Условия эксплуатации",
  "title": "उपयोग की शर्तें",
  "warranties_and_liability": "गारंटी और दायित्व"
}