{
  "booking_and_cancellation": "Reservas e cancelamentos",
  "booking_requirements": "Para se registrar em tratamentos, você deve fornecer um contato válido informação. Reservamo-nos o direito de confirmar ou recusar a sua reserva.",
  "cancellation_policy": "Política de Cancelamento",
  "cancellation_policy_text": "O cliente poderá cancelar o agendamento até 24 horas antes do horário agendado. Se cancelado com menos de 24 horas de antecedência, poderá ser cobrada uma multa de 50% do custo do serviço.",
  "client_obligations": "Antes do procedimento, o cliente deve informar o especialista sobre contra-indicações médicas, alergias ou condições de saúde.",
  "confidentiality": "Confidencialidade",
  "contact_info": "Você pode entrar em contato conosco se tiver qualquer dúvida sobre estes Termos.",
  "contacts": "Contatos",
  "dissatisfaction_policy": "Caso o resultado não seja satisfatório, o cliente deverá entrar em contato com o salão em até 7 dias para discutir possíveis soluções.",
  "general_provisions": "Regras Gerais",
  "general_provisions_text": "Estes Termos de Uso regem o seu utilização dos Serviços M Le Diamant. Ao utilizar nossos serviços, você concorda com estes termos.",
  "lastUpdated": "Data da última atualização: {{date}}",
  "last_update_date": "Data da última atualização",
  "late_arrival": "Se o cliente se atrasar mais de 15 minutos, o salão tem o direito de cancelar a consulta ou reduzir o tempo do procedimento.",
  "medical_contraindications": "Contra-indicações médicas",
  "payment_details": "O pagamento é feito em dinheiro ou cartão após a prestação do serviço. O custo dos serviços está indicado na tabela de preços e está sujeito a alterações sem aviso prévio.",
  "payment_for_services": "Pagamento dos serviços",
  "privacy_commitment": "Respeitamos a sua privacidade e estamos empenhados em proteger as suas informações pessoais de acordo com a nossa política de privacidade.",
  "quality_guarantee": "Garantimos a qualidade dos materiais utilizados e o profissionalismo dos nossos artesãos. Os resultados do procedimento podem variar dependendo das características individuais do cliente.",
  "salon_liability": "Se o cliente ocultar informações sobre contraindicações médicas, o salão não se responsabiliza pelas consequências dos procedimentos.",
  "sections": {
    "booking": {
      "booking_requirements": "Para se inscrever nos Procedimentos, você deve fornecer informações de contato válidas. Reservamo-nos o direito de confirmar ou recusar a sua reserva.",
      "cancellationText": "O cliente poderá cancelar a marcação até 24 horas antes da hora marcada. Se cancelado com menos de 24 horas de antecedência, poderá ser cobrada uma multa de 50% do custo do serviço.",
      "cancellationTitle": "Cancelar assinatura:",
      "title": "2. Reservas e cancelamentos"
    },
    "changes": {
      "content": "Reservamo-nos o direito de alterar estes Termos de Uso a qualquer momento. As alterações entram em vigor a partir do momento em que são publicadas no site.",
      "title": "7. Alterações nos Termos de Uso"
    },
    "contact": {
      "address": "Endereço",
      "description": "Você pode entrar em contato conosco caso tenha alguma dúvida sobre estes Termos:",
      "email": "Endereço de e-mail",
      "phone": "Telefone",
      "title": "8. Contatos"
    },
    "general": {
      "content": "Estes Termos de Uso regem o uso dos Serviços {{salonName}}. Ao utilizar nossos serviços você concorda com estes termos.",
      "title": "1. Regras gerais"
    },
    "medical": {
      "paragraph1": "Antes do procedimento, o cliente deve informar o especialista sobre contraindicações médicas, alergias ou problemas de saúde.",
      "paragraph2": "Se o cliente ocultar informações sobre contraindicações médicas, o salão não se responsabiliza pelas consequências dos procedimentos.",
      "title": "4. Contra-indicações médicas."
    },
    "payment": {
      "paragraph1": "O pagamento é feito em dinheiro ou cartão após a prestação do serviço. O custo dos serviços está indicado na tabela de preços e pode ser alterado sem aviso prévio.",
      "paragraph2": "Se o cliente se atrasar mais de 15 minutos, o salão reserva-se o direito de cancelar a marcação ou encurtar o tempo do procedimento.",
      "title": "3. Pagamento por serviços"
    },
    "privacy": {
      "content": "Respeitamos sua privacidade e estamos comprometidos em proteger suas informações pessoais de acordo com nossa <link>Política de Privacidade</link>.",
      "title": "6. Confidencialidade"
    },
    "warranty": {
      "paragraph1": "Garantimos a qualidade dos materiais utilizados e o profissionalismo dos nossos artesãos. Os resultados do procedimento podem variar dependendo das características individuais do cliente.",
      "paragraph2": "Caso o resultado não seja satisfatório, o cliente deverá entrar em contato com o salão em até 7 dias para discutir possíveis soluções.",
      "title": "5. Garantias e Responsabilidade"
    }
  },
  "terms_changes": "Alterações nos Termos de Uso",
  "terms_changes_text": "Reservamo-nos o direito de alterar estes Termos de Uso a qualquer momento. As alterações entram em vigor a partir do momento em que são publicadas no site.",
  "terms_of_use": "Condições de uso",
  "title": "Condições de uso",
  "warranties_and_liability": "Garantias e responsabilidade"
}