{
  "title": "Политика конфиденциальности",
  "locale": "ru-RU",
  "lastUpdated": "Дата последнего обновления: {{date}}",
  "sections": {
    "introduction": {
      "title": "1. Введение",
      "content": "{{salonName}} серьезно относится к защите вашей конфиденциальности. Данная Политика конфиденциальности описывает, какую информацию мы собираем, как мы ее используем и защищаем."
    },
    "collectedInfo": {
      "title": "2. Собираемая информация",
      "description": "Мы можем собирать следующую информацию:",
      "items": [
        "Имя и контактную информацию (телефон, email)",
        "История посещений и оказанных услуг",
        "Предпочтения в услугах и процедурах",
        "Информацию о медицинских противопоказаниях (с вашего согласия)",
        "Фотографии результатов работы (только с вашего письменного согласия)"
      ]
    },
    "dataUsage": {
      "title": "3. Использование информации",
      "description": "Мы используем собранную информацию для:",
      "items": [
        "Организации и подтверждения ваших записей",
        "Предоставления качественных услуг с учетом ваших особенностей",
        "Отправки напоминаний о записях",
        "Информирования о новых услугах и специальных предложениях (с вашего согласия)",
        "Улучшения качества наших услуг"
      ]
    },
    "dataProtection": {
      "title": "4. Защита данных",
      "paragraph1": "Мы принимаем все необходимые меры для защиты ваших персональных данных от несанкционированного доступа, изменения, раскрытия или уничтожения.",
      "paragraph2": "Доступ к вашим данным имеют только уполномоченные сотрудники, которые обязаны соблюдать конфиденциальность."
    },
    "thirdParty": {
      "title": "5. Передача данных третьим лицам",
      "paragraph1": "Мы не продаем, не обмениваем и не передаем вашу личную информацию третьим лицам без вашего явного согласия, за исключением случаев, предусмотренных законодательством.",
      "paragraph2": "Мы можем передавать обезличенную статистическую информацию нашим партнерам для улучшения качества услуг."
    },
    "cookies": {
      "title": "6. Cookies и технологии отслеживания",
      "content": "Наш веб-сайт может использовать файлы cookie для улучшения пользовательского опыта. Вы можете отключить cookies в настройках вашего браузера."
    },
    "rights": {
      "title": "7. Ваши права",
      "description": "Вы имеете право:",
      "items": [
        "Запросить доступ к вашим персональным данным",
        "Запросить исправление неточных данных",
        "Запросить удаление ваших данных",
        "Отозвать согласие на обработку данных в любое время",
        "Отказаться от получения рекламных рассылок"
      ]
    },
    "dataStorage": {
      "title": "8. Хранение данных",
      "content": "Мы храним ваши персональные данные только в течение времени, необходимого для целей, указанных в данной Политике, или в соответствии с требованиями законодательства."
    },
    "policyChanges": {
      "title": "9. Изменения в Политике",
      "content": "Мы оставляем за собой право обновлять данную Политику конфиденциальности. Обновления будут опубликованы на этой странице с указанием даты последнего изменения."
    },
    "contact": {
      "title": "10. Контакты",
      "description": "По вопросам, касающимся данной Политики конфиденциальности, вы можете связаться с нами:",
      "phone": "Телефон",
      "email": "Email",
      "address": "Адрес"
    }
  }
}
