{
  "items": [
    {
      "id": 671,
      "name": "Kasymova Gulchekhre",
      "position": "Meister der Maniküre und Enthaarung, Gesichtspflege",
      "bio": "Gulya ist eine anerkannte Expertin auf dem Gebiet der Maniküre, Enthaarung und professionellen Gesichtspflege mit 8 Jahren Erfahrung. Durch ihre Beherrschung ästhetischer Transformationstechniken und ihre Liebe zum Detail schafft sie makellose Bilder und bietet jedem Kunden ein Höchstmaß an Sorgfalt und professionellem Ansatz.",
      "photo": ""
    },
    {
      "id": 672,
      "name": "Peradilla Jennifer",
      "position": "Universal Beauty Master",
      "bio": "Jennifer verkörpert das Talent einer multidisziplinären Fachkraft. Sie führt sowohl grundlegende als auch komplexe Schönheitsbehandlungen meisterhaft durch und bietet so einen umfassenden und harmonischen Ansatz für Ihre Transformation.",
      "photo": ""
    },
    {
      "id": 673,
      "name": "Amandurdyyeva Mestan",
      "position": "Friseur und Permanent Makeup Artist",
      "bio": "Mestan ist ein einzigartiger Meister, der das Talent eines Top-Stylisten und eines Permanent-Make-up-Experten vereint. Ihr umfassendes Wissen ermöglicht es Ihnen, vollständige und makellose Bilder zu erstellen, die Ihre Individualität hervorheben.",
      "photo": ""
    },
    {
      "id": 674,
      "name": "Mokhammed Sabri",
      "position": "Top-Stylist",
      "bio": "Simo ist der führende Experte unseres Salons im Bereich Premium-Pflege und komplexe Farbgebung. Seine langjährige internationale Erfahrung und proprietäre Techniken garantieren Ergebnisse der Spitzenklasse.",
      "photo": ""
    },
    {
      "id": 675,
      "name": "Kozhabay Lyazat",
      "position": "Nail Master",
      "bio": "Lyazat ist ein wahrer Perfektionist in der Nagelservicebranche. Mit tadellosem Geschmack und Liebe zum Detail kreiert sie die perfekte Maniküre und Pediküre und kümmert sich dabei um die Ästhetik und Gesundheit Ihrer Hände.",
      "photo": ""
    }
  ]
}